[
  {
    "id": "1758788127082ba3e09eeb90468",
    "front": "What is UML and why is it particularly useful for a Bioinformatician?",
    "back": "UML (Unified Modeling Language) is a standardized visual modeling language used for specifying, visualizing, constructing, and documenting software-intensive systems. For a Bioinformatician, it's useful for clearly documenting complex biological workflows, data models (e.g., genomic databases), system architectures, and interactions between different bioinformatics tools or components, facilitating communication within interdisciplinary teams.",
    "repetition": 0,
    "interval": 1,
    "easeFactor": 2.5,
    "dueDate": "2025-09-25"
  },
  {
    "id": "1758788127082bc34f497474b6",
    "front": "Which UML diagrams are most relevant for a Bioinformatician when modeling biological systems or data pipelines?",
    "back": "The most relevant UML diagrams for a Bioinformatician include: Activity Diagrams (for workflows and pipelines), Class Diagrams (for data models and object structures like genes, proteins, or samples), Component Diagrams (for modular software architectures), and Sequence Diagrams (for illustrating interactions between systems or services, e.g., an analysis pipeline calling different web services).",
    "repetition": 0,
    "interval": 1,
    "easeFactor": 2.5,
    "dueDate": "2025-09-25"
  },
  {
    "id": "1758788127082d49013a535dbe8",
    "front": "How can a Bioinformatician utilize a UML Class Diagram to model biological data?",
    "back": "A Bioinformatician can use a Class Diagram to model the structure of biological data. For example, they could define classes like 'Gene', 'Protein', 'Variant', or 'Sample', specifying their attributes (e.g., gene_id, protein_sequence, variant_position) and relationships (e.g., 'Gene' produces 'Protein', 'Sample' has 'Variants'). This helps in designing databases, understanding data structures, and ensuring data consistency.",
    "repetition": 0,
    "interval": 1,
    "easeFactor": 2.5,
    "dueDate": "2025-09-25"
  },
  {
    "id": "17587881270827c948c2860bef8",
    "front": "Describe how an Activity Diagram can be applied by a Bioinformatician to represent a bioinformatics workflow.",
    "back": "An Activity Diagram is ideal for modeling step-by-step processes or workflows. A Bioinformatician can use it to visualize a sequencing data analysis pipeline: starting with 'Raw Data QC', branching to 'Alignment' or 'Variant Calling', then merging for 'Annotation' and finally 'Report Generation'. It clearly shows the sequence of actions, decision points, and parallel activities within a biological experiment or computational analysis.",
    "repetition": 0,
    "interval": 1,
    "easeFactor": 2.5,
    "dueDate": "2025-09-25"
  },
  {
    "id": "1758788127082e5cacc9b9c0e1",
    "front": "What benefit does a UML Sequence Diagram offer to a Bioinformatician, especially in the context of system interactions?",
    "back": "A Sequence Diagram illustrates the order of messages exchanged between objects or systems over time. For a Bioinformatician, it's beneficial for understanding and documenting interactions in a distributed bioinformatics system, such as a client querying a genomic database, a script sending data to a remote analysis server, or how different microservices in a pipeline communicate. It clarifies the chronological flow of operations and helps identify bottlenecks or design flaws in communication.",
    "repetition": 0,
    "interval": 1,
    "easeFactor": 2.5,
    "dueDate": "2025-09-25"
  }
]